export const partyColors: Record<string, string> = {
    // 16대 (2000~2004)
    한나라당: '#e61e2b',
    새누리당: '#e61e2b',
    민주당: '#005bac',
    새천년민주당: '#005bac',
    자유민주연합: '#009246',

    // 17대 (2004~2008)
    열린우리당: '#005bac',
    민주노동당: '#b61c1c',

    // 18대 (2008~2012)
    자유선진당: '#009246',

    // 19대 (2012~2016)
    민주통합당: '#005bac',
    통합진보당: '#009246',
    진보정의당: '#b61c1c',

    // 20대 (2016~2020)
    자유한국당: '#e61e2b',
    더불어민주당: '#005bac',
    국민의당: '#ffcc00',
    정의당: '#ffcb08',
    바른정당: '#1e60b7',

    // 21대 (2020~2024)
    국민의힘: '#e61e2b',
    기본소득당: '#00a651',
    시대전환: '#6c3483',
    열린민주당: '#00b8ff',

    // 22대 (2024~ )
    국민의미래: '#e61e2b',
    더불어민주연합: '#005bac',
    조국혁신당: '#06275e',
    녹색정의당: '#1ca261',
    개혁신당: '#6c3483',
    새로운미래: '#00b8ff',
};
